*** src/distill/acceptance_extractor.rs:130:24: delete ! in HeuristicAcceptanceExtractor::extract_acceptance

*** mutation diff:
--- src/distill/acceptance_extractor.rs
+++ delete ! in HeuristicAcceptanceExtractor::extract_acceptance
@@ -122,17 +122,17 @@
 
         for msg in &session.messages {
             let lower = msg.content.to_lowercase();
 
             // --- General evidence ---
             for pat in EVIDENCE_PATTERNS {
                 if lower.contains(pat) {
                     let ev = format!("Evidence: '{pat}'");
-                    if !evidence.contains(&ev) {
+                    if  /* ~ changed by cargo-mutants ~ */evidence.contains(&ev) {
                         evidence.push(ev);
                         // Count toward satisfaction
                         confirmation_count += 1;
                     }
                 }
             }
 
             // --- User confirmation (only user messages) ---

---- distill::acceptance_extractor::tests::extracts_evidence_from_test_and_build_signals stdout ----

thread 'distill::acceptance_extractor::tests::extracts_evidence_from_test_and_build_signals' (1376760) panicked at src/distill/acceptance_extractor.rs:215:9:
assertion failed: acc.evidence.iter().any(|e| e.contains("all tests pass"))

failures:
    distill::acceptance_extractor::tests::extracts_evidence_from_test_and_build_signals

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
