*** src/distill/acceptance_extractor.rs:133:44: replace += with -= in HeuristicAcceptanceExtractor::extract_acceptance

*** mutation diff:
--- src/distill/acceptance_extractor.rs
+++ replace += with -= in HeuristicAcceptanceExtractor::extract_acceptance
@@ -125,17 +125,17 @@
 
             // --- General evidence ---
             for pat in EVIDENCE_PATTERNS {
                 if lower.contains(pat) {
                     let ev = format!("Evidence: '{pat}'");
                     if !evidence.contains(&ev) {
                         evidence.push(ev);
                         // Count toward satisfaction
-                        confirmation_count += 1;
+                        confirmation_count -= /* ~ changed by cargo-mutants ~ */ 1;
                     }
                 }
             }
 
             // --- User confirmation (only user messages) ---
             if msg.role == Role::User {
                 for pat in USER_CONFIRMATION_PATTERNS {
                     if lower.contains(pat) {

---- distill::acceptance_extractor::tests::detects_confirmation_from_user_messages_only stdout ----

thread 'distill::acceptance_extractor::tests::detects_confirmation_from_user_messages_only' (1379455) panicked at src/distill/acceptance_extractor.rs:133:25:
attempt to subtract with overflow

---- distill::acceptance_extractor::tests::extracts_testing_evidence stdout ----

thread 'distill::acceptance_extractor::tests::extracts_testing_evidence' (1379459) panicked at src/distill/acceptance_extractor.rs:133:25:
attempt to subtract with overflow

---- distill::acceptance_extractor::tests::detects_user_confirmation stdout ----

thread 'distill::acceptance_extractor::tests::detects_user_confirmation' (1379456) panicked at src/distill/acceptance_extractor.rs:133:25:
attempt to subtract with overflow

failures:
    distill::acceptance_extractor::tests::acceptance_extractor_trait_works
    distill::acceptance_extractor::tests::detects_confirmation_from_user_messages_only
    distill::acceptance_extractor::tests::detects_user_confirmation
    distill::acceptance_extractor::tests::extracts_evidence_from_test_and_build_signals
    distill::acceptance_extractor::tests::extracts_testing_evidence
    distill::acceptance_extractor::tests::satisfaction_score_is_nonzero_for_valid_session
    distill::compiler::tests::full_bundle_compilation_produces_all_expected_kinds
    distill::compiler::tests::render_injectable_produces_non_empty_text

test result: FAILED. 28 passed; 8 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
