*** src/distill/acceptance_extractor.rs:139:25: replace == with != in HeuristicAcceptanceExtractor::extract_acceptance

*** mutation diff:
--- src/distill/acceptance_extractor.rs
+++ replace == with != in HeuristicAcceptanceExtractor::extract_acceptance
@@ -131,17 +131,17 @@
                         evidence.push(ev);
                         // Count toward satisfaction
                         confirmation_count += 1;
                     }
                 }
             }
 
             // --- User confirmation (only user messages) ---
-            if msg.role == Role::User {
+            if msg.role != /* ~ changed by cargo-mutants ~ */ Role::User {
                 for pat in USER_CONFIRMATION_PATTERNS {
                     if lower.contains(pat) {
                         user_confirmed = true;
                         confirmation_count += 1;
                         break; // one confirmation is enough
                     }
                 }
             }

---- distill::acceptance_extractor::tests::detects_user_confirmation stdout ----

thread 'distill::acceptance_extractor::tests::detects_user_confirmation' (1385019) panicked at src/distill/acceptance_extractor.rs:224:9:
user said 'looks good, approved'

---- distill::acceptance_extractor::tests::acceptance_extractor_trait_works stdout ----

thread 'distill::acceptance_extractor::tests::acceptance_extractor_trait_works' (1385017) panicked at src/distill/acceptance_extractor.rs:269:9:
assertion failed: acc.user_confirmed

---- distill::acceptance_extractor::tests::detects_confirmation_from_user_messages_only stdout ----

thread 'distill::acceptance_extractor::tests::detects_confirmation_from_user_messages_only' (1385018) panicked at src/distill/acceptance_extractor.rs:253:9:
user said 'thanks'

failures:
    distill::acceptance_extractor::tests::acceptance_extractor_trait_works
    distill::acceptance_extractor::tests::detects_confirmation_from_user_messages_only
    distill::acceptance_extractor::tests::detects_user_confirmation
    distill::acceptance_extractor::tests::returns_empty_for_no_signals

test result: FAILED. 32 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
