*** src/distill/acceptance_extractor.rs:143:44: replace += with -= in HeuristicAcceptanceExtractor::extract_acceptance

*** mutation diff:
--- src/distill/acceptance_extractor.rs
+++ replace += with -= in HeuristicAcceptanceExtractor::extract_acceptance
@@ -135,17 +135,17 @@
                 }
             }
 
             // --- User confirmation (only user messages) ---
             if msg.role == Role::User {
                 for pat in USER_CONFIRMATION_PATTERNS {
                     if lower.contains(pat) {
                         user_confirmed = true;
-                        confirmation_count += 1;
+                        confirmation_count -= /* ~ changed by cargo-mutants ~ */ 1;
                         break; // one confirmation is enough
                     }
                 }
             }
 
             // --- Testing evidence ---
             for pat in TESTING_EVIDENCE_PATTERNS {
                 if lower.contains(pat) {

*** result: Success
