*** src/distill/acceptance_extractor.rs:153:24: delete ! in HeuristicAcceptanceExtractor::extract_acceptance

*** mutation diff:
--- src/distill/acceptance_extractor.rs
+++ delete ! in HeuristicAcceptanceExtractor::extract_acceptance
@@ -145,17 +145,17 @@
                     }
                 }
             }
 
             // --- Testing evidence ---
             for pat in TESTING_EVIDENCE_PATTERNS {
                 if lower.contains(pat) {
                     let te = format!("Testing: '{pat}'");
-                    if !testing_evidence.contains(&te) {
+                    if  /* ~ changed by cargo-mutants ~ */testing_evidence.contains(&te) {
                         testing_evidence.push(te);
                     }
                 }
             }
         }
 
         // Heuristic satisfaction score: clamp to 0–100.
         // Base: 10 per confirmation up to max 100.

---- distill::acceptance_extractor::tests::detects_confirmation_from_user_messages_only stdout ----

thread 'distill::acceptance_extractor::tests::detects_confirmation_from_user_messages_only' (1393593) panicked at src/distill/acceptance_extractor.rs:254:9:
assertion failed: acc.testing_evidence.iter().any(|t| t.contains("test"))

---- distill::acceptance_extractor::tests::extracts_testing_evidence stdout ----

thread 'distill::acceptance_extractor::tests::extracts_testing_evidence' (1393597) panicked at src/distill/acceptance_extractor.rs:231:9:
assertion failed: acc.testing_evidence.iter().any(|t| t.contains("test"))

failures:
    distill::acceptance_extractor::tests::detects_confirmation_from_user_messages_only
    distill::acceptance_extractor::tests::extracts_testing_evidence

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
