*** src/distill/compiler.rs:158:9: replace BundleCompiler<IE, CE, CtrE, AE>::render_injectable -> String with "xyzzy".into()

*** mutation diff:
--- src/distill/compiler.rs
+++ replace BundleCompiler<IE, CE, CtrE, AE>::render_injectable -> String with "xyzzy".into()
@@ -150,82 +150,17 @@
 
     /// Render a compiled bundle as injectable text payload for a new session.
     ///
     /// The output is a formatted text block suitable for injection as a system
     /// prompt or context prefix in a new agent session. All bundle slices are
     /// rendered in a structured, human-readable format.
     #[must_use]
     pub fn render_injectable(&self, bundle: &ContinuationBundle) -> String {
-        let mut parts: Vec<String> = Vec::new();
-
-        parts.push(format!(
-            "[CONTINUATION BUNDLE] source: {} | injectable: {}",
-            bundle.source_id,
-            if bundle.is_injectable() { "YES" } else { "NO" }
-        ));
-
-        let total_tokens = bundle.total_token_estimate();
-        parts.push(format!(
-            "token budget estimate: ~{total_tokens} (sum across {} slices)",
-            bundle.bundles.len()
-        ));
-        parts.push(String::new());
-
-        for slice in &bundle.bundles {
-            let label = match slice.kind {
-                BundleKind::Acceptance => "--- ACCEPTANCE (resume gate) ---",
-                BundleKind::Intent => "--- INTENT (goal / acceptance signals) ---",
-                BundleKind::Context => "--- CONTEXT (working state) ---",
-                BundleKind::Contract => "--- CONTRACT (criteria / constraints) ---",
-                BundleKind::Provenance => "--- PROVENANCE (origin) ---",
-                BundleKind::Worklog => "--- WORKLOG (diff / outstanding) ---",
-                BundleKind::Dedup => "--- DEDUP (merge key) ---",
-            };
-            parts.push(label.to_string());
-
-            match &slice.kind {
-                BundleKind::Acceptance
-                | BundleKind::Intent
-                | BundleKind::Context
-                | BundleKind::Contract
-                | BundleKind::Provenance
-                | BundleKind::Worklog
-                | BundleKind::Dedup => {
-                    // Render the JSON body in a compact but readable form.
-                    if let Some(obj) = slice.body.as_object() {
-                        for (key, val) in obj {
-                            let rendered = match val {
-                                serde_json::Value::String(s) => s.clone(),
-                                serde_json::Value::Array(arr) => {
-                                    let items: Vec<String> = arr
-                                        .iter()
-                                        .filter_map(|v| v.as_str().map(String::from))
-                                        .collect();
-                                    if items.is_empty() {
-                                        "(empty)".to_string()
-                                    } else {
-                                        items.join(", ")
-                                    }
-                                }
-                                other => other.to_string(),
-                            };
-                            parts.push(format!("  {key}: {rendered}"));
-                        }
-                    } else {
-                        parts.push(format!("  {}", slice.body));
-                    }
-                }
-            }
-
-            parts.push(String::new());
-        }
-
-        parts.push("--- END CONTINUATION BUNDLE ---".to_string());
-        parts.join("\n")
+        "xyzzy".into() /* ~ changed by cargo-mutants ~ */
     }
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::distill::acceptance_extractor::HeuristicAcceptanceExtractor;
     use crate::distill::context_extractor::HeuristicContextExtractor;

---- distill::compiler::tests::render_injectable_produces_non_empty_text stdout ----

thread 'distill::compiler::tests::render_injectable_produces_non_empty_text' (1403512) panicked at src/distill/compiler.rs:225:9:
must have bundle header

failures:
    distill::compiler::tests::render_injectable_produces_non_empty_text

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.07s

*** result: Failure(101)
