*** src/distill/context_extractor.rs:104:78: replace && with || in HeuristicContextExtractor::extract_context

*** mutation diff:
--- src/distill/context_extractor.rs
+++ replace && with || in HeuristicContextExtractor::extract_context
@@ -96,17 +96,17 @@
         for msg in &session.messages {
             let content = msg.content.as_str();
             let lower = content.to_lowercase();
             let tokens: Vec<&str> = content.split_whitespace().collect();
 
             // --- Files ---
             for token in &tokens {
                 let clean = token.trim_matches(|c: char| {
-                    !c.is_alphanumeric() && c != '/' && c != '.' && c != '-' && c != '_'
+                    !c.is_alphanumeric() && c != '/' && c != '.' && c != '-' || /* ~ changed by cargo-mutants ~ */ c != '_'
                 });
                 if is_file_path(clean) {
                     let fp = clean.to_string();
                     if !files_mentioned.contains(&fp) {
                         files_mentioned.push(fp);
                     }
                 }
             }

---- distill::context_extractor::tests::extracts_files_mentioned_from_messages stdout ----

thread 'distill::context_extractor::tests::extracts_files_mentioned_from_messages' (1406119) panicked at src/distill/context_extractor.rs:232:9:
assertion failed: ctx.files_mentioned.iter().any(|f| f == "src/auth/mod.rs")

failures:
    distill::context_extractor::tests::extracts_files_mentioned_from_messages

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.05s

*** result: Failure(101)
