*** src/distill/context_extractor.rs:108:24: delete ! in HeuristicContextExtractor::extract_context

*** mutation diff:
--- src/distill/context_extractor.rs
+++ delete ! in HeuristicContextExtractor::extract_context
@@ -100,17 +100,17 @@
 
             // --- Files ---
             for token in &tokens {
                 let clean = token.trim_matches(|c: char| {
                     !c.is_alphanumeric() && c != '/' && c != '.' && c != '-' && c != '_'
                 });
                 if is_file_path(clean) {
                     let fp = clean.to_string();
-                    if !files_mentioned.contains(&fp) {
+                    if  /* ~ changed by cargo-mutants ~ */files_mentioned.contains(&fp) {
                         files_mentioned.push(fp);
                     }
                 }
             }
 
             // --- Symbols (identifiers with :: or () pattern) ---
             // Look for token-like patterns (CamelCase, snake_case with parens or ::)
             for token in &tokens {

---- distill::context_extractor::tests::extracts_files_mentioned_from_messages stdout ----

thread 'distill::context_extractor::tests::extracts_files_mentioned_from_messages' (1418964) panicked at src/distill/context_extractor.rs:232:9:
assertion failed: ctx.files_mentioned.iter().any(|f| f == "src/auth/mod.rs")

failures:
    distill::context_extractor::tests::extracts_files_mentioned_from_messages

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
