*** src/distill/context_extractor.rs:118:23: replace == with != in HeuristicContextExtractor::extract_context

*** mutation diff:
--- src/distill/context_extractor.rs
+++ replace == with != in HeuristicContextExtractor::extract_context
@@ -110,17 +110,17 @@
                     }
                 }
             }
 
             // --- Symbols (identifiers with :: or () pattern) ---
             // Look for token-like patterns (CamelCase, snake_case with parens or ::)
             for token in &tokens {
                 let clean = token.trim_matches(|c: char| {
-                    c == '('
+                    c != /* ~ changed by cargo-mutants ~ */ '('
                         || c == ')'
                         || c == ','
                         || c == ';'
                         || c == '{'
                         || c == '}'
                         || c == '['
                         || c == ']'
                 });

---- distill::context_extractor::tests::extracts_symbols_from_code_mentions stdout ----

thread 'distill::context_extractor::tests::extracts_symbols_from_code_mentions' (1432775) panicked at src/distill/context_extractor.rs:244:9:
assertion failed: ctx.key_symbols.iter().any(|s|
        s == "verify_token" || s.contains("verify_token"))

failures:
    distill::context_extractor::tests::extracts_symbols_from_code_mentions

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
