*** src/distill/context_extractor.rs:119:30: replace == with != in HeuristicContextExtractor::extract_context

*** mutation diff:
--- src/distill/context_extractor.rs
+++ replace == with != in HeuristicContextExtractor::extract_context
@@ -111,17 +111,17 @@
                 }
             }
 
             // --- Symbols (identifiers with :: or () pattern) ---
             // Look for token-like patterns (CamelCase, snake_case with parens or ::)
             for token in &tokens {
                 let clean = token.trim_matches(|c: char| {
                     c == '('
-                        || c == ')'
+                        || c != /* ~ changed by cargo-mutants ~ */ ')'
                         || c == ','
                         || c == ';'
                         || c == '{'
                         || c == '}'
                         || c == '['
                         || c == ']'
                 });
                 let is_func_call = token.contains("()");

---- distill::context_extractor::tests::extracts_symbols_from_code_mentions stdout ----

thread 'distill::context_extractor::tests::extracts_symbols_from_code_mentions' (1435342) panicked at src/distill/context_extractor.rs:244:9:
assertion failed: ctx.key_symbols.iter().any(|s|
        s == "verify_token" || s.contains("verify_token"))

failures:
    distill::context_extractor::tests::extracts_symbols_from_code_mentions

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.06s

*** result: Failure(101)
