*** src/distill/context_extractor.rs:122:25: replace || with && in HeuristicContextExtractor::extract_context

*** mutation diff:
--- src/distill/context_extractor.rs
+++ replace || with && in HeuristicContextExtractor::extract_context
@@ -114,17 +114,17 @@
             // --- Symbols (identifiers with :: or () pattern) ---
             // Look for token-like patterns (CamelCase, snake_case with parens or ::)
             for token in &tokens {
                 let clean = token.trim_matches(|c: char| {
                     c == '('
                         || c == ')'
                         || c == ','
                         || c == ';'
-                        || c == '{'
+                        && /* ~ changed by cargo-mutants ~ */ c == '{'
                         || c == '}'
                         || c == '['
                         || c == ']'
                 });
                 let is_func_call = token.contains("()");
                 if clean.contains("::") || is_func_call {
                     let sym = clean.to_string();
                     if !key_symbols.contains(&sym) {

*** result: Success
