*** src/distill/context_extractor.rs:123:30: replace == with != in HeuristicContextExtractor::extract_context

*** mutation diff:
--- src/distill/context_extractor.rs
+++ replace == with != in HeuristicContextExtractor::extract_context
@@ -115,17 +115,17 @@
             // Look for token-like patterns (CamelCase, snake_case with parens or ::)
             for token in &tokens {
                 let clean = token.trim_matches(|c: char| {
                     c == '('
                         || c == ')'
                         || c == ','
                         || c == ';'
                         || c == '{'
-                        || c == '}'
+                        || c != /* ~ changed by cargo-mutants ~ */ '}'
                         || c == '['
                         || c == ']'
                 });
                 let is_func_call = token.contains("()");
                 if clean.contains("::") || is_func_call {
                     let sym = clean.to_string();
                     if !key_symbols.contains(&sym) {
                         key_symbols.push(sym);

---- distill::context_extractor::tests::extracts_symbols_from_code_mentions stdout ----

thread 'distill::context_extractor::tests::extracts_symbols_from_code_mentions' (1440973) panicked at src/distill/context_extractor.rs:244:9:
assertion failed: ctx.key_symbols.iter().any(|s|
        s == "verify_token" || s.contains("verify_token"))

failures:
    distill::context_extractor::tests::extracts_symbols_from_code_mentions

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
