*** src/distill/context_extractor.rs:130:24: delete ! in HeuristicContextExtractor::extract_context

*** mutation diff:
--- src/distill/context_extractor.rs
+++ delete ! in HeuristicContextExtractor::extract_context
@@ -122,17 +122,17 @@
                         || c == '{'
                         || c == '}'
                         || c == '['
                         || c == ']'
                 });
                 let is_func_call = token.contains("()");
                 if clean.contains("::") || is_func_call {
                     let sym = clean.to_string();
-                    if !key_symbols.contains(&sym) {
+                    if  /* ~ changed by cargo-mutants ~ */key_symbols.contains(&sym) {
                         key_symbols.push(sym);
                     }
                 }
             }
 
             // --- Decisions ---
             for pat in DECISION_PATTERNS {
                 if lower.contains(pat) {

---- distill::context_extractor::tests::extracts_symbols_from_code_mentions stdout ----

thread 'distill::context_extractor::tests::extracts_symbols_from_code_mentions' (1444696) panicked at src/distill/context_extractor.rs:244:9:
assertion failed: ctx.key_symbols.iter().any(|s|
        s == "verify_token" || s.contains("verify_token"))

failures:
    distill::context_extractor::tests::extracts_symbols_from_code_mentions

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
