*** src/distill/context_extractor.rs:141:24: delete ! in HeuristicContextExtractor::extract_context

*** mutation diff:
--- src/distill/context_extractor.rs
+++ delete ! in HeuristicContextExtractor::extract_context
@@ -133,17 +133,17 @@
                 }
             }
 
             // --- Decisions ---
             for pat in DECISION_PATTERNS {
                 if lower.contains(pat) {
                     let summary = format!("Session contains '{pat}' language");
                     let decision = Decision { summary, rationale: Some(content.to_string()) };
-                    if !key_decisions.iter().any(|d| d.summary == decision.summary) {
+                    if  /* ~ changed by cargo-mutants ~ */key_decisions.iter().any(|d| d.summary == decision.summary) {
                         key_decisions.push(decision);
                     }
                 }
             }
 
             // --- Environment notes ---
             for pat in ENVIRONMENT_PATTERNS {
                 if lower.contains(pat) {

---- distill::context_extractor::tests::extracts_decisions_from_discourse stdout ----

thread 'distill::context_extractor::tests::extracts_decisions_from_discourse' (1445780) panicked at src/distill/context_extractor.rs:238:9:
assertion failed: ctx.key_decisions.iter().any(|d| d.summary.contains("decided"))

failures:
    distill::context_extractor::tests::extracts_decisions_from_discourse

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
