*** src/distill/context_extractor.rs:141:64: replace == with != in HeuristicContextExtractor::extract_context

*** mutation diff:
--- src/distill/context_extractor.rs
+++ replace == with != in HeuristicContextExtractor::extract_context
@@ -133,17 +133,17 @@
                 }
             }
 
             // --- Decisions ---
             for pat in DECISION_PATTERNS {
                 if lower.contains(pat) {
                     let summary = format!("Session contains '{pat}' language");
                     let decision = Decision { summary, rationale: Some(content.to_string()) };
-                    if !key_decisions.iter().any(|d| d.summary == decision.summary) {
+                    if !key_decisions.iter().any(|d| d.summary != /* ~ changed by cargo-mutants ~ */ decision.summary) {
                         key_decisions.push(decision);
                     }
                 }
             }
 
             // --- Environment notes ---
             for pat in ENVIRONMENT_PATTERNS {
                 if lower.contains(pat) {

*** result: Success
