*** src/distill/context_extractor.rs:151:24: delete ! in HeuristicContextExtractor::extract_context

*** mutation diff:
--- src/distill/context_extractor.rs
+++ delete ! in HeuristicContextExtractor::extract_context
@@ -143,17 +143,17 @@
                     }
                 }
             }
 
             // --- Environment notes ---
             for pat in ENVIRONMENT_PATTERNS {
                 if lower.contains(pat) {
                     let note = format!("Session mentions '{pat}'");
-                    if !environment_notes.contains(&note) {
+                    if  /* ~ changed by cargo-mutants ~ */environment_notes.contains(&note) {
                         environment_notes.push(note);
                     }
                 }
             }
         }
 
         // Deduplicate environment notes by prefix (collapse "Session mentions 'npm'"
         // and "Session mentions 'cargo'" into a single note if both appear from

---- distill::context_extractor::tests::extracts_environment_notes stdout ----

thread 'distill::context_extractor::tests::extracts_environment_notes' (1447195) panicked at src/distill/context_extractor.rs:251:9:
assertion failed: notes.iter().any(|n| n.contains("install") || n.contains("cargo"))

failures:
    distill::context_extractor::tests::extracts_environment_notes

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
