*** src/distill/context_extractor.rs:184:40: replace < with > in is_file_path

*** mutation diff:
--- src/distill/context_extractor.rs
+++ replace < with > in is_file_path
@@ -176,17 +176,17 @@
     fn extract(&self, session: &Session) -> Result<Context, PortError> {
         Ok(Self::extract_context(session))
     }
 }
 
 /// Whether a whitespace-delimited token looks like a file path.
 #[must_use]
 fn is_file_path(token: &str) -> bool {
-    if token.is_empty() || token.len() < 3 {
+    if token.is_empty() || token.len() > /* ~ changed by cargo-mutants ~ */ 3 {
         return false;
     }
     // Must contain a `/` or start like a relative path (e.g. `src/`).
     if token.contains('/') {
         return true;
     }
     // Match common file extensions.
     let lower = token.to_lowercase();

---- distill::context_extractor::tests::extracts_files_mentioned_from_messages stdout ----

thread 'distill::context_extractor::tests::extracts_files_mentioned_from_messages' (1451596) panicked at src/distill/context_extractor.rs:232:9:
assertion failed: ctx.files_mentioned.iter().any(|f| f == "src/auth/mod.rs")

failures:
    distill::context_extractor::tests::extracts_files_mentioned_from_messages

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
