*** src/distill/context_extractor.rs:184:5: replace is_file_path -> bool with true

*** mutation diff:
--- src/distill/context_extractor.rs
+++ replace is_file_path -> bool with true
@@ -176,26 +176,17 @@
     fn extract(&self, session: &Session) -> Result<Context, PortError> {
         Ok(Self::extract_context(session))
     }
 }
 
 /// Whether a whitespace-delimited token looks like a file path.
 #[must_use]
 fn is_file_path(token: &str) -> bool {
-    if token.is_empty() || token.len() < 3 {
-        return false;
-    }
-    // Must contain a `/` or start like a relative path (e.g. `src/`).
-    if token.contains('/') {
-        return true;
-    }
-    // Match common file extensions.
-    let lower = token.to_lowercase();
-    FILE_EXTENSIONS.iter().any(|ext| lower.ends_with(ext) && lower.len() > ext.len())
+    true /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::domain::session::{Corpus, Message, Role};
 
     fn fixture_session() -> Session {

*** result: Success
