*** src/distill/context_extractor.rs:184:5: replace is_file_path -> bool with false

*** mutation diff:
--- src/distill/context_extractor.rs
+++ replace is_file_path -> bool with false
@@ -176,26 +176,17 @@
     fn extract(&self, session: &Session) -> Result<Context, PortError> {
         Ok(Self::extract_context(session))
     }
 }
 
 /// Whether a whitespace-delimited token looks like a file path.
 #[must_use]
 fn is_file_path(token: &str) -> bool {
-    if token.is_empty() || token.len() < 3 {
-        return false;
-    }
-    // Must contain a `/` or start like a relative path (e.g. `src/`).
-    if token.contains('/') {
-        return true;
-    }
-    // Match common file extensions.
-    let lower = token.to_lowercase();
-    FILE_EXTENSIONS.iter().any(|ext| lower.ends_with(ext) && lower.len() > ext.len())
+    false /* ~ changed by cargo-mutants ~ */
 }
 
 #[cfg(test)]
 mod tests {
     use super::*;
     use crate::domain::session::{Corpus, Message, Role};
 
     fn fixture_session() -> Session {

---- distill::context_extractor::tests::extracts_files_mentioned_from_messages stdout ----

thread 'distill::context_extractor::tests::extracts_files_mentioned_from_messages' (1448588) panicked at src/distill/context_extractor.rs:223:9:
assertion failed: ctx.files_mentioned.iter().any(|f| f == "src/auth/mod.rs")

failures:
    distill::context_extractor::tests::extracts_files_mentioned_from_messages

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.03s

*** result: Failure(101)
