*** src/distill/contract_extractor.rs:132:24: delete ! in HeuristicContractExtractor::extract_contract

*** mutation diff:
--- src/distill/contract_extractor.rs
+++ delete ! in HeuristicContractExtractor::extract_contract
@@ -124,17 +124,17 @@
         // Scan user and assistant messages for contract signals.
         for msg in &session.messages {
             let lower = msg.content.to_lowercase();
 
             // --- Success criteria ---
             for pat in CRITERIA_PATTERNS {
                 if lower.contains(pat) {
                     let crit = format!("Goal/requirement: '{pat}'");
-                    if !success_criteria.contains(&crit) {
+                    if  /* ~ changed by cargo-mutants ~ */success_criteria.contains(&crit) {
                         success_criteria.push(crit);
                     }
                 }
             }
 
             // --- Tests / verifications ---
             for pat in TEST_PATTERNS {
                 if lower.contains(pat) {

---- distill::contract_extractor::tests::contract_extractor_trait_works stdout ----

thread 'distill::contract_extractor::tests::contract_extractor_trait_works' (1456199) panicked at src/distill/contract_extractor.rs:234:9:
assertion failed: !contract.success_criteria.is_empty()

---- distill::contract_extractor::tests::extracts_success_criteria_from_goal_language stdout ----

thread 'distill::contract_extractor::tests::extracts_success_criteria_from_goal_language' (1456202) panicked at src/distill/contract_extractor.rs:201:9:
assertion failed: contract.success_criteria.iter().any(|c| c.contains("goal"))

failures:
    distill::contract_extractor::tests::contract_extractor_trait_works
    distill::contract_extractor::tests::extracts_success_criteria_from_goal_language

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
