*** src/distill/contract_extractor.rs:142:24: delete ! in HeuristicContractExtractor::extract_contract

*** mutation diff:
--- src/distill/contract_extractor.rs
+++ delete ! in HeuristicContractExtractor::extract_contract
@@ -134,17 +134,17 @@
                     }
                 }
             }
 
             // --- Tests / verifications ---
             for pat in TEST_PATTERNS {
                 if lower.contains(pat) {
                     let test = format!("Verification: '{pat}'");
-                    if !tests_or_verifications.contains(&test) {
+                    if  /* ~ changed by cargo-mutants ~ */tests_or_verifications.contains(&test) {
                         tests_or_verifications.push(test);
                     }
                 }
             }
 
             // --- Constraints ---
             for pat in CONSTRAINT_PATTERNS {
                 if lower.contains(pat) {

---- distill::contract_extractor::tests::extracts_test_verification_commands stdout ----

thread 'distill::contract_extractor::tests::extracts_test_verification_commands' (1456124) panicked at src/distill/contract_extractor.rs:208:9:
assertion failed: contract.tests_or_verifications.iter().any(|t| t.contains("cargo test"))

failures:
    distill::contract_extractor::tests::extracts_test_verification_commands

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
