*** src/distill/contract_extractor.rs:152:24: delete ! in HeuristicContractExtractor::extract_contract

*** mutation diff:
--- src/distill/contract_extractor.rs
+++ delete ! in HeuristicContractExtractor::extract_contract
@@ -144,17 +144,17 @@
                     }
                 }
             }
 
             // --- Constraints ---
             for pat in CONSTRAINT_PATTERNS {
                 if lower.contains(pat) {
                     let constraint = format!("Constraint: '{pat}'");
-                    if !constraints.contains(&constraint) {
+                    if  /* ~ changed by cargo-mutants ~ */constraints.contains(&constraint) {
                         constraints.push(constraint);
                     }
                 }
             }
 
             // --- Do-not-touch ---
             for pat in DO_NOT_TOUCH_PATTERNS {
                 if lower.contains(pat) {

---- distill::contract_extractor::tests::extracts_constraints_from_modal_language stdout ----

thread 'distill::contract_extractor::tests::extracts_constraints_from_modal_language' (1457740) panicked at src/distill/contract_extractor.rs:220:9:
assertion failed: contract.constraints.iter().any(|c| c.contains("must") || c.contains("needs"))

failures:
    distill::contract_extractor::tests::extracts_constraints_from_modal_language

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.00s

*** result: Failure(101)
