*** src/distill/contract_extractor.rs:162:24: delete ! in HeuristicContractExtractor::extract_contract

*** mutation diff:
--- src/distill/contract_extractor.rs
+++ delete ! in HeuristicContractExtractor::extract_contract
@@ -154,17 +154,17 @@
                     }
                 }
             }
 
             // --- Do-not-touch ---
             for pat in DO_NOT_TOUCH_PATTERNS {
                 if lower.contains(pat) {
                     let dnt = format!("Do-not-touch: '{pat}'");
-                    if !do_not_touch.contains(&dnt) {
+                    if  /* ~ changed by cargo-mutants ~ */do_not_touch.contains(&dnt) {
                         do_not_touch.push(dnt);
                     }
                 }
             }
         }
 
         Contract { success_criteria, tests_or_verifications, constraints, do_not_touch }
     }

---- distill::contract_extractor::tests::extracts_do_not_touch_rules stdout ----

thread 'distill::contract_extractor::tests::extracts_do_not_touch_rules' (1457854) panicked at src/distill/contract_extractor.rs:214:9:
assertion failed: contract.do_not_touch.iter().any(|d| d.contains("don't touch"))

failures:
    distill::contract_extractor::tests::extracts_do_not_touch_rules

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
