*** src/distill/extractor.rs:108:24: delete ! in HeuristicIntentExtractor::extract_intent

*** mutation diff:
--- src/distill/extractor.rs
+++ delete ! in HeuristicIntentExtractor::extract_intent
@@ -100,17 +100,17 @@
         // Constraints: collect matched patterns found in user messages.
         let mut constraints: Vec<String> = Vec::new();
 
         for msg in &user_messages {
             let lower = msg.to_lowercase();
             for pat in ACCEPTANCE_PATTERNS {
                 if lower.contains(pat) {
                     let signal = pat.to_string();
-                    if !acceptance_signals.contains(&signal) {
+                    if  /* ~ changed by cargo-mutants ~ */acceptance_signals.contains(&signal) {
                         acceptance_signals.push(signal);
                     }
                 }
             }
             for pat in CONSTRAINT_PATTERNS {
                 if lower.contains(pat) {
                     let constraint = pat.to_string();
                     if !constraints.contains(&constraint) {

---- distill::extractor::tests::deduplicates_repeated_acceptance_signal stdout ----

thread 'distill::extractor::tests::deduplicates_repeated_acceptance_signal' (1462063) panicked at src/distill/extractor.rs:210:9:
assertion `left == right` failed
  left: 0
 right: 1

---- distill::extractor::tests::extracts_acceptance_signals_and_constraints stdout ----

thread 'distill::extractor::tests::extracts_acceptance_signals_and_constraints' (1462064) panicked at src/distill/extractor.rs:181:9:
assertion failed: intent.acceptance_signals.contains(&"looks good".to_string())

---- export::okf::tests::okf_contains_expected_entity_kinds stdout ----

thread 'export::okf::tests::okf_contains_expected_entity_kinds' (1462071) panicked at src/export/okf.rs:292:9:
should have acceptance entity

failures:
    distill::extractor::tests::deduplicates_repeated_acceptance_signal
    distill::extractor::tests::extracts_acceptance_signals_and_constraints
    export::okf::tests::okf_contains_expected_entity_kinds
    export::okf::tests::okf_relations_have_correct_types_and_provenance

test result: FAILED. 32 passed; 4 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
