*** src/distill/extractor.rs:116:24: delete ! in HeuristicIntentExtractor::extract_intent

*** mutation diff:
--- src/distill/extractor.rs
+++ delete ! in HeuristicIntentExtractor::extract_intent
@@ -108,17 +108,17 @@
                     if !acceptance_signals.contains(&signal) {
                         acceptance_signals.push(signal);
                     }
                 }
             }
             for pat in CONSTRAINT_PATTERNS {
                 if lower.contains(pat) {
                     let constraint = pat.to_string();
-                    if !constraints.contains(&constraint) {
+                    if  /* ~ changed by cargo-mutants ~ */constraints.contains(&constraint) {
                         constraints.push(constraint);
                     }
                 }
             }
         }
 
         Intent { goal, acceptance_signals, constraints, user_turn_count }
     }

---- distill::extractor::tests::extracts_acceptance_signals_and_constraints stdout ----

thread 'distill::extractor::tests::extracts_acceptance_signals_and_constraints' (1462892) panicked at src/distill/extractor.rs:183:9:
assertion failed: intent.constraints.contains(&"don't change".to_string())

---- export::okf::tests::okf_contains_expected_entity_kinds stdout ----

thread 'export::okf::tests::okf_contains_expected_entity_kinds' (1462899) panicked at src/export/okf.rs:293:9:
should have constraint entity

---- export::okf::tests::okf_relations_have_correct_types_and_provenance stdout ----

thread 'export::okf::tests::okf_relations_have_correct_types_and_provenance' (1462902) panicked at src/export/okf.rs:323:9:
should have bounded_by edges

failures:
    distill::extractor::tests::extracts_acceptance_signals_and_constraints
    export::okf::tests::okf_contains_expected_entity_kinds
    export::okf::tests::okf_relations_have_correct_types_and_provenance

test result: FAILED. 33 passed; 3 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
