*** src/distill/extractor.rs:85:32: replace == with != in HeuristicIntentExtractor::extract_intent

*** mutation diff:
--- src/distill/extractor.rs
+++ replace == with != in HeuristicIntentExtractor::extract_intent
@@ -77,17 +77,17 @@
     /// This is factored as a public associated function so it can be used
     /// directly by the compiler without going through the trait when no
     /// adapter injection is needed (P1 default).
     #[must_use]
     pub fn extract_intent(session: &Session) -> Intent {
         let user_messages: Vec<&str> = session
             .messages
             .iter()
-            .filter(|m| m.role == Role::User)
+            .filter(|m| m.role != /* ~ changed by cargo-mutants ~ */ Role::User)
             .map(|m| m.content.as_str())
             .collect();
 
         let user_turn_count = user_messages.len();
 
         // Goal: first substantial user message (>20 chars) or the very first one.
         let goal = user_messages
             .iter()

---- distill::extractor::tests::intent_extractor_trait_works stdout ----

thread 'distill::extractor::tests::intent_extractor_trait_works' (1459655) panicked at src/distill/extractor.rs:219:9:
assertion `left == right` failed
  left: None
 right: Some("refactor the database layer")

---- distill::extractor::tests::deduplicates_repeated_acceptance_signal stdout ----

thread 'distill::extractor::tests::deduplicates_repeated_acceptance_signal' (1459651) panicked at src/distill/extractor.rs:210:9:
assertion `left == right` failed
  left: 0
 right: 1

---- distill::extractor::tests::ignores_assistant_messages_when_extracting_intent stdout ----

thread 'distill::extractor::tests::ignores_assistant_messages_when_extracting_intent' (1459654) panicked at src/distill/extractor.rs:202:9:
assertion `left == right` failed
  left: Some("sure, let me implement that")
 right: Some("add a rate limiter to the api")

failures:
    distill::extractor::tests::deduplicates_repeated_acceptance_signal
    distill::extractor::tests::extracts_acceptance_signals_and_constraints
    distill::extractor::tests::extracts_goal_from_first_substantial_user_message
    distill::extractor::tests::ignores_assistant_messages_when_extracting_intent
    distill::extractor::tests::intent_extractor_trait_works
    export::okf::tests::okf_contains_expected_entity_kinds
    export::okf::tests::okf_relations_have_correct_types_and_provenance

test result: FAILED. 29 passed; 7 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
