*** src/distill/extractor.rs:94:35: replace > with == in HeuristicIntentExtractor::extract_intent

*** mutation diff:
--- src/distill/extractor.rs
+++ replace > with == in HeuristicIntentExtractor::extract_intent
@@ -86,17 +86,17 @@
             .map(|m| m.content.as_str())
             .collect();
 
         let user_turn_count = user_messages.len();
 
         // Goal: first substantial user message (>20 chars) or the very first one.
         let goal = user_messages
             .iter()
-            .find(|msg| msg.len() > 20)
+            .find(|msg| msg.len() == /* ~ changed by cargo-mutants ~ */ 20)
             .or_else(|| user_messages.first())
             .map(|msg| (*msg).to_string());
 
         // Acceptance signals: collect matched patterns found in user messages.
         let mut acceptance_signals: Vec<String> = Vec::new();
         // Constraints: collect matched patterns found in user messages.
         let mut constraints: Vec<String> = Vec::new();

---- distill::extractor::tests::extracts_goal_from_first_substantial_user_message stdout ----

thread 'distill::extractor::tests::extracts_goal_from_first_substantial_user_message' (1459736) panicked at src/distill/extractor.rs:167:9:
assertion `left == right` failed
  left: Intent { goal: Some("hi"), acceptance_signals: [], constraints: [], user_turn_count: 2 }
 right: Intent { goal: Some("can you fix the login bug in the auth module"), acceptance_signals: [], constraints: [], user_turn_count: 2 }

failures:
    distill::extractor::tests::extracts_goal_from_first_substantial_user_message

test result: FAILED. 35 passed; 1 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.01s

*** result: Failure(101)
