*** src/domain/acceptance.rs:47:9: replace Acceptance::is_empty -> bool with false

*** mutation diff:
--- src/domain/acceptance.rs
+++ replace Acceptance::is_empty -> bool with false
@@ -39,11 +39,11 @@
             testing_evidence: Vec::new(),
             satisfaction_score: 0,
         }
     }
 
     /// Whether the extractor found any meaningful acceptance data.
     #[must_use]
     pub fn is_empty(&self) -> bool {
-        self.evidence.is_empty() && !self.user_confirmed && self.testing_evidence.is_empty()
+        false /* ~ changed by cargo-mutants ~ */
     }
 }

---- distill::acceptance_extractor::tests::empty_session_returns_empty stdout ----

thread 'distill::acceptance_extractor::tests::empty_session_returns_empty' (1464277) panicked at src/distill/acceptance_extractor.rs:261:9:
assertion failed: acc.is_empty()

---- distill::acceptance_extractor::tests::returns_empty_for_no_signals stdout ----

thread 'distill::acceptance_extractor::tests::returns_empty_for_no_signals' (1464280) panicked at src/distill/acceptance_extractor.rs:245:9:
assertion failed: acc.is_empty()

failures:
    distill::acceptance_extractor::tests::empty_session_returns_empty
    distill::acceptance_extractor::tests::returns_empty_for_no_signals

test result: FAILED. 34 passed; 2 failed; 0 ignored; 0 measured; 0 filtered out; finished in 0.02s

*** result: Failure(101)
